// Copyright 2024 Vladislav Aleinik
#ifndef HEADER_GUARD_UTILS_H_INCLUDED
#define HEADER_GUARD_UTILS_H_INCLUDED

#include <stdlib.h>
#include <stdio.h>
#include <stdarg.h>

//=================//
// Удобные функции //
//=================//

//==================================================================================================
// Функция: MIN
// Назначение: вычисляет минимальное из двух чисел
//--------------------------------------------------------------------------------------------------
// Параметры:
// a (in) - первый аргумент.
// b (in) - второй аргумент.
//
// Возвращаемое значение:
// Меньшее из двух чисел.
//
// Используемые внешние переменные:
// отсутствуют
//
// Примечания:
// отсутствуют
//==================================================================================================
inline unsigned MIN(unsigned a, unsigned b)
{
    return a < b? a : b;
}

//==================================================================================================
// Функция: VERIFY_CONTRACT
// Назначение:
// Производит проверку входных данных. В случае ошибки выводит сообщение об ошибке.
//--------------------------------------------------------------------------------------------------
// Параметры:
// condition (in) - условие, которое требуется проверять.
// format (in) - формат сообщения об ошибке (см. printf).
// ... - дополнительные аргументы, соответствующие формату (см. printf).
//
// Возвращаемое значение:
// отсутствует
//
// Используемые внешние переменные:
// отсутствуют
//
// Примечания:
// - В случае невыполнения условия функция печатает сообщение об ошибке
//   и завершает выполнение программы.
// - Автор реализации - Максим Кузнецов.
//==================================================================================================
void VERIFY_CONTRACT(bool condition, const char* restrict format, ...)
{
    if (!condition) {
        va_list vargs;
        va_start(vargs, format);
        vprintf(format, vargs);
        va_end(vargs);
        exit(EXIT_FAILURE);
    }
}

#endif // HEADER_GUARD_UTILS_H_INCLUDED
